#+BEGIN_COMMENT
.. title: Openshift and Kubernetes Commands
.. slug: openshift-and-kubernetes-commands
.. date: 2020-02-05 13:26:21 UTC+01:00
.. tags: IT Architecture, Container Management
.. category: 
.. link: 
.. description: 
.. type: text

#+END_COMMENT

#+BEGIN_EXPORT html
<br>
<br>
#+END_EXPORT

This post outlines some of the commands to operate on your Kubernetes
and Openshift cluster via CLI.

It does not contain any Kubernetes or Openshift theoretical content
which is rather available at the [[https://marcohassan.github.io/bits-of-experience/posts/Kubernetes/][following post]].

#+BEGIN_EXPORT html
<br>
#+END_EXPORT

{{{TEASER_END}}}

*** Configure your Kubeconfig file 

    This is the foremost important step as you have to specify the
    kubernetes/openshift cluster you want to operate on.

    Kubectl is a command line tool for controlling Kubernetes
    clusters. 

    kubectl looks for a file named config in the $HOME/.kube
    directory. You can specify other kubeconfig files by setting the
    KUBECONFIG environment variable or by setting the --kubeconfig
    flag. 

    In this sense you can look up for instance the various clusters
    running on your IBM cloud by running

    #+BEGIN_SRC sh :results output
    ibmcloud ks cluster ls
    #+END_SRC

    #+RESULTS:
    : OK
    : Name          ID                     State    Created       Workers   Location    Version                   Resource Group Name   Provider   
    : DATAiks       xxx                    normal   3 weeks ago   1         Frankfurt   1.14.9_1541*              Default               classic   
    : myDataShild   YYY                    normal   1 month ago   1         Frankfurt   3.11.154_1533_openshift   Default               classic   

    You can then withdraw the specific configuration settings for a
    cluster by running

    #+BEGIN_SRC sh
    ibmcloud ks cluster config <cluster-ID>
    #+END_SRC

    Finally you can export it and configuring the KUBECONFIG file by running.

    #+BEGIN_SRC sh
    export KUBECONFIG=/Users/marcohassan/.bluemix/plugins/container-service/clusters/<cluster-id>/<configuration .yaml>
    #+END_SRC

    Notice that by exporting multiple kubeconfig files you can handle
    multiple customers/applications from the same machine and through
    the same CLI.

    An important thing in this context is on how to handle different
    kubernetes clusters contemporarily. You can refer to this [[https://medium.com/faun/using-different-kubectl-versions-with-multiple-kubernetes-clusters-a3ad8707b87b][nice
    intro]].

*** On Kubernetes Contexts

    To view your configuration file with all of its contexts and users use:

    #+BEGIN_SRC sh :results drawer
    kubectl config view -o json
    #+END_SRC

    The KUBECONFIG file contains several things of interest including the
    cluster information so that kubectl is executing commands on the
    correct cluster. It also stores authentication information such as
    username/passwords, certificates or tokens. Lastly, the KUBECONFIG
    file stores contexts.

    Contexts group access information under an easily recognizable
    name. So a context would include a cluster, a user and a
    namespace. Now you can use KUBECONFIG and context to set our default
    namespaces. No more logging in and being dumped into the default
    namespace.

    What if you do not need a context anymore 

    #+BEGIN_SRC sh
    kubectl config get-contexts
    #+END_SRC

    #+RESULTS:
    | CURRENT                                                                             | NAME                                        | CLUSTER                                                              | AUTHINFO                                              | NAMESPACE |
    | ibm-cert-store/c100-e-eu-de-containers-cloud-ibm-com:31633/IAM#marco.hassan@ibm.com | c100-e-eu-de-containers-cloud-ibm-com:31633 | IAM#marco.hassan@ibm.com/c100-e-eu-de-containers-cloud-ibm-com:31633 | ibm-cert-store                                        |           |

    #+BEGIN_SRC sh
   kubectl config unset contexts.ibm-cert-store/c100-e-eu-de-containers-cloud-ibm-com:31633/IAM#marco.hassan@ibm.com
    #+END_SRC

    #+RESULTS:
    : contexts.ibm-cert-store/c100-e-eu-de-containers-cloud-ibm-com:31633/IAM#marco.hassan@ibm.com

